using System;

namespace Task_2_4
{
    class Program
    {
        static void Main(string[] args)
        {
            string name = "Иванов Иван";
            double sum = 170.55;
            double cash = 500;
            double odd = cash - sum;
            Console.WriteLine($"***************************************\n" +
                               $" Чек ПРОДАЖА № 9999.2.407.518          \n" +
                               $" Касса № 2                             \n" +
                               $" {DateTime.Now}         {name}    \n" +
                               $"---------------------------------------\n" +
                               $" Молоко                       =49.90\n" +
                               $" Хлеб                         =35.15\n" +
                               $" Масло                        =85.50\n" +
                               $"---------------------------------------\n" +
                               $" ИТОГО без скидок:                     \n" +
                               $" Итого скидок:                         \n" +
                               $" ИТОГО с учетом скидок:                \n" +
                               $" ВНЕСЕНО:                              \n" +
                               $" СДАЧА:                                \n" +
                               $" Наличные:                             \n" +
                               $"            СПАСИБО ЗА ПОКУПКУ!        \n" +
                               $" ИТОГ                         ={sum}\n" +
                               $"   Наличными                  ={cash}\n" +
                               $"СДАЧА                         ={odd}\n" +
                               $"***************************************");
        }
    }
}
